#Использовать ".."
#Использовать 1bdd

КаталогПроекта = ОбъединитьПути(ТекущийСценарий().Каталог, "..");

ПутьОтчетаJUnit = ОбъединитьПути(КаталогПроекта, "test-reports", "junit-bdd.xml");

КаталогФич = ОбъединитьПути(КаталогПроекта, "features");
Файл_КаталогФич = Новый Файл(КаталогФич);

ИсполнительБДД = Новый ИсполнительБДД;
РезультатыВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
ИтоговыйРезультатВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);

СтатусВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения().НеВыполнялся;
Если РезультатыВыполнения.Строки.Количество() > 0 Тогда
	
	СтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);
	
КонецЕсли;

ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
ГенераторОтчетаJUnit.Сформировать(РезультатыВыполнения, СтатусВыполнения, ПутьОтчетаJUnit);

Сообщить(СтрШаблон("Результат выполнения bdd-tests: %1", ИтоговыйРезультатВыполнения));

Если ИтоговыйРезультатВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения().Сломался Тогда
	
	ВызватьИсключение 1;
	
КонецЕсли;



