#Использовать asserts
#Использовать "../src"

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    Список = Новый Массив;
   	Список.Добавить("Тест_ДолженПроверитьЧтоКонфигурацияРазобранаНаИсходники");
   	Список.Добавить("Тест_ДолженПроверитьЧтоКонфигурацияСобранаИзИсходников");
    //Список.Добавить("Тест_ДолженПроверитьЧтоВерсияПолученаИзХранилища");
    //Список.Добавить("Тест_ДолженПроверитьЧтоСозданыФайлыКонфигурацииПоставщика");
    //Список.Добавить("Тест_ДолженПроверитьЧтоСозданДистрибутив");
    //Список.Добавить("Тест_ДолженПроверитьЧтоСозданАрхивДистрибутива");
    //Список.Добавить("Тест_ДолженПроверитьЧтоВерсияПолученаСПомощьюTool1CD");
    
    Возврат Список;
    
КонецФункции


Процедура ПослеЗапускаТеста() Экспорт
    //ВременныеФайлы.Удалить();
КонецПроцедуры

Процедура Тест_ДолженПроверитьЧтоКонфигурацияРазобранаНаИсходники() Экспорт

	ФайлКонфигурации = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "1.0","1Cv8.cf");
	
	ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();
   
   	РазборщикКонфигурации = Новый МенеджерРазборкиКонфигурацииНаИсходники;
	РазборщикКонфигурации.РазобратьФайлКонфигурации(ФайлКонфигурации, ВременныйКаталог);
		
КонецПроцедуры

Процедура Тест_ДолженПроверитьЧтоКонфигурацияСобранаИзИсходников() Экспорт

	ФайлКонфигурации = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "1.0","1Cv8.cf");
	
	ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();
   	ВременныйКаталогКонфигурации = ВременныеФайлы.СоздатьКаталог();
   	
	РазборщикКонфигурации = Новый МенеджерРазборкиКонфигурацииНаИсходники;
	РазборщикКонфигурации.РазобратьФайлКонфигурации(ФайлКонфигурации, ВременныйКаталог);
	
	НовыйФайлКонфигурации = ОбъединитьПути(ВременныйКаталогКонфигурации, "1Cv8.cf");
	
	
	СборщикКонфигурации = Новый МенеджерСборкиКонфигурацииИзИсходников;
	СборщикКонфигурации.СобратьФайлКонфигурации(ВременныйКаталог, НовыйФайлКонфигурации);
	
	ФайлТест = Новый Файл(НовыйФайлКонфигурации);
    Ожидаем.Что(ФайлТест.Существует(), "файл конфигурации должен существовать"); 
   

	// Сделать сравнение 2-х файлов через hash

КонецПроцедуры
